[NoCoverage] ObjectLiteral
src/app/app-routing.module.ts:10:3
 
 const routes: Routes = [
   { path: '', component: HomeComponent },
-  { path: 'course-overview', component: CourseOverviewComponent },
+  {},
   { path: 'add-course', component: AddCourseComponent},
 ];

[NoCoverage] StringLiteral
src/app/app-routing.module.ts:10:11
 
 const routes: Routes = [
   { path: '', component: HomeComponent },
-  { path: 'course-overview', component: CourseOverviewComponent },
+  { path: "", component: CourseOverviewComponent },
   { path: 'add-course', component: AddCourseComponent},
 ];
