[NoCoverage] StringLiteral
app/components/add-course/add-course.component.ts:20:21
     ) { }
 
   input : string = "";
-  message: string = "";
+  message: string = "Stryker was here!";
   duplicateMessage : string = "";
   errorMessage : string = "";

[NoCoverage] StringLiteral
app/components/add-course/add-course.component.ts:21:31
 
   input : string = "";
   message: string = "";
-  duplicateMessage : string = "";
+  duplicateMessage : string = "Stryker was here!";
   errorMessage : string = "";
   duplicateCourseInstances: number = 0;

[NoCoverage] BlockStatement
app/components/add-course/add-course.component.ts:29:30
   values: CourseOverview[] = [];
   stats: CoursesAddedStats = {} as CoursesAddedStats;
 
-  getFile(event: any) : void {
-    console.log('GetFile');
-    this.duplicateCourseInstances = 0;
-    this.readFile(event.target.files[0]);
-  };
+  getFile(event: any) : void {};
 
   readFile = (file: any) => {

[NoCoverage] BlockStatement
app/components/add-course/add-course.component.ts:38:36
   readFile = (file: any) => {
     console.log('Read');
     const fileReader : FileReader = new FileReader();
-    fileReader.onloadend = (ev) => {
-      const data = fileReader.result;
-      var txtData = data!.toString();
-      this.checkFileService.checkForErrors(txtData)
-        .then(x => this.errorMessage = x)
-        .then(() => {if(this.errorMessage === "") {
-          console.log('errorHandling');
-          this.values = this.uploadFileService.upload(txtData);
-          this.uploadFileService.PostCourses(this.values)
-          .then(x => (this.stats = x, console.log('stats update')))
-          .then(() => (
-            console.log('instance update'),
-            this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) || []).length, 
-            this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,
-            this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))
-          .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)
-          .then(() => { 
-            if (this.duplicateCourseInstances > 0) 
-            {
-              this.duplicateMessage = `Er zijn ${this.duplicateCourseInstances} duplicaten tegengekomen`
-            }
-        })
-        }} 
-      ) 
-    }
+    fileReader.onloadend = (ev) => {}
     fileReader.readAsText(file);
   }

[NoCoverage] ArrowFunction
app/components/add-course/add-course.component.ts:42:15
       const data = fileReader.result;
       var txtData = data!.toString();
       this.checkFileService.checkForErrors(txtData)
-        .then(x => this.errorMessage = x)
+        .then(() => undefined)
         .then(() => {if(this.errorMessage === "") {
           console.log('errorHandling');

[NoCoverage] BlockStatement
app/components/add-course/add-course.component.ts:43:51
       var txtData = data!.toString();
       this.checkFileService.checkForErrors(txtData)
         .then(x => this.errorMessage = x)
-        .then(() => {if(this.errorMessage === "") {
-          console.log('errorHandling');
-          this.values = this.uploadFileService.upload(txtData);
-          this.uploadFileService.PostCourses(this.values)
-          .then(x => (this.stats = x, console.log('stats update')))
-          .then(() => (
-            console.log('instance update'),
-            this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) || []).length, 
-            this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,
-            this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))
-          .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)
-          .then(() => { 
-            if (this.duplicateCourseInstances > 0) 
-            {
-              this.duplicateMessage = `Er zijn ${this.duplicateCourseInstances} duplicaten tegengekomen`
-            }
-        })
-        }} 
+        .then(() => {if(this.errorMessage === "") {}} 
       ) 
     }

[NoCoverage] BlockStatement
app/components/add-course/add-course.component.ts:43:21
       var txtData = data!.toString();
       this.checkFileService.checkForErrors(txtData)
         .then(x => this.errorMessage = x)
-        .then(() => {if(this.errorMessage === "") {
-          console.log('errorHandling');
-          this.values = this.uploadFileService.upload(txtData);
-          this.uploadFileService.PostCourses(this.values)
-          .then(x => (this.stats = x, console.log('stats update')))
-          .then(() => (
-            console.log('instance update'),
-            this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) || []).length, 
-            this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,
-            this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))
-          .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)
-          .then(() => { 
-            if (this.duplicateCourseInstances > 0) 
-            {
-              this.duplicateMessage = `Er zijn ${this.duplicateCourseInstances} duplicaten tegengekomen`
-            }
-        })
-        }} 
+        .then(() => {} 
       ) 
     }

[NoCoverage] ArrowFunction
app/components/add-course/add-course.component.ts:47:17
           console.log('errorHandling');
           this.values = this.uploadFileService.upload(txtData);
           this.uploadFileService.PostCourses(this.values)
-          .then(x => (this.stats = x, console.log('stats update')))
+          .then(() => undefined)
           .then(() => (
             console.log('instance update'),

[NoCoverage] ArrowFunction
app/components/add-course/add-course.component.ts:48:17
           this.values = this.uploadFileService.upload(txtData);
           this.uploadFileService.PostCourses(this.values)
           .then(x => (this.stats = x, console.log('stats update')))
-          .then(() => (
-            console.log('instance update'),
-            this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) || []).length, 
-            this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,
-            this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))
+          .then(() => undefined)
           .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)
           .then(() => { 

[NoCoverage] StringLiteral
app/components/add-course/add-course.component.ts:49:25
           this.uploadFileService.PostCourses(this.values)
           .then(x => (this.stats = x, console.log('stats update')))
           .then(() => (
-            console.log('instance update'),
+            console.log(""),
             this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) || []).length, 
             this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,

[NoCoverage] ConditionalExpression
app/components/add-course/add-course.component.ts:50:46
           .then(x => (this.stats = x, console.log('stats update')))
           .then(() => (
             console.log('instance update'),
-            this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) || []).length, 
+            this.duplicateCourseInstances = (false).length, 
             this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,
             this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))

[NoCoverage] LogicalOperator
app/components/add-course/add-course.component.ts:50:46
           .then(x => (this.stats = x, console.log('stats update')))
           .then(() => (
             console.log('instance update'),
-            this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) || []).length, 
+            this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) && []).length, 
             this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,
             this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))

[NoCoverage] ConditionalExpression
app/components/add-course/add-course.component.ts:51:40
           .then(() => (
             console.log('instance update'),
             this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) || []).length, 
-            this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,
+            this.newCourseInstances = (false).length,
             this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))
           .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)

[NoCoverage] LogicalOperator
app/components/add-course/add-course.component.ts:51:40
           .then(() => (
             console.log('instance update'),
             this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) || []).length, 
-            this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,
+            this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) && []).length,
             this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))
           .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)

[NoCoverage] ConditionalExpression
app/components/add-course/add-course.component.ts:52:32
             console.log('instance update'),
             this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) || []).length, 
             this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,
-            this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))
+            this.newCourses = (true).length))
           .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)
           .then(() => { 

[NoCoverage] ConditionalExpression
app/components/add-course/add-course.component.ts:52:32
             console.log('instance update'),
             this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) || []).length, 
             this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,
-            this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))
+            this.newCourses = (false).length))
           .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)
           .then(() => { 

[NoCoverage] ArrowFunction
app/components/add-course/add-course.component.ts:53:17
             this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) || []).length, 
             this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,
             this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))
-          .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)
+          .then(() => undefined)
           .then(() => { 
             if (this.duplicateCourseInstances > 0) 

[NoCoverage] StringLiteral
app/components/add-course/add-course.component.ts:53:38
             this.duplicateCourseInstances = (this.stats.courseInstancesAdded.match(/d/g) || []).length, 
             this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,
             this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))
-          .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)
+          .then(() => this.message = ``)
           .then(() => { 
             if (this.duplicateCourseInstances > 0) 

[NoCoverage] BlockStatement
app/components/add-course/add-course.component.ts:54:23
             this.newCourseInstances = (this.stats.courseInstancesAdded.match(/n/g) || []).length,
             this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))
           .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)
-          .then(() => { 
-            if (this.duplicateCourseInstances > 0) 
-            {
-              this.duplicateMessage = `Er zijn ${this.duplicateCourseInstances} duplicaten tegengekomen`
-            }
-        })
+          .then(() => {})
         }} 
       ) 

[NoCoverage] EqualityOperator
app/components/add-course/add-course.component.ts:55:17
             this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))
           .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)
           .then(() => { 
-            if (this.duplicateCourseInstances > 0) 
+            if (this.duplicateCourseInstances <= 0) 
             {
               this.duplicateMessage = `Er zijn ${this.duplicateCourseInstances} duplicaten tegengekomen`

[NoCoverage] ConditionalExpression
app/components/add-course/add-course.component.ts:55:17
             this.newCourses = (this.stats.coursesAdded.match(/n/g) || []).length))
           .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)
           .then(() => { 
-            if (this.duplicateCourseInstances > 0) 
+            if (true) 
             {
               this.duplicateMessage = `Er zijn ${this.duplicateCourseInstances} duplicaten tegengekomen`

[NoCoverage] BlockStatement
app/components/add-course/add-course.component.ts:56:13
           .then(() => this.message = `Er zijn ${ this.newCourses } nieuwe cursussen en ${ this.newCourseInstances } nieuwe cursus instanties toegevoegd!`)
           .then(() => { 
             if (this.duplicateCourseInstances > 0) 
-            {
-              this.duplicateMessage = `Er zijn ${this.duplicateCourseInstances} duplicaten tegengekomen`
-            }
+            {}
         })
         }} 

[NoCoverage] StringLiteral
app/components/add-course/add-course.component.ts:57:39
           .then(() => { 
             if (this.duplicateCourseInstances > 0) 
             {
-              this.duplicateMessage = `Er zijn ${this.duplicateCourseInstances} duplicaten tegengekomen`
+              this.duplicateMessage = ``
             }
         })
