[Survived] BooleanLiteral
app/components/course-overview/course-overview.component.ts:17:24
 
   subscription!: Subscription;
   allcourses: CourseOverview[] = [];
-  isLoading: boolean = true;
+  isLoading: boolean = false;
   currentWeek : number = moment().week();
   currentYear : number = moment().year();

[Survived] BooleanLiteral
app/components/course-overview/course-overview.component.ts:26:20
   getCoursesByWeekYearForm = new FormGroup({
     chosenWeek: new FormControl(moment().week(), {
       validators: [Validators.required, Validators.min(1), Validators.max(53)],
-      nonNullable: true
+      nonNullable: false
     }),
     chosenYear: new FormControl(moment().year(), { 

[Survived] ArithmeticOperator
app/components/course-overview/course-overview.component.ts:29:56
       nonNullable: true
     }),
     chosenYear: new FormControl(moment().year(), { 
-      validators: [Validators.required, Validators.min(moment().year() - 5), Validators.max(moment().year() + 1)],
+      validators: [Validators.required, Validators.min(moment().year() + 5), Validators.max(moment().year() + 1)],
       nonNullable: true 
     })

[Survived] ArithmeticOperator
app/components/course-overview/course-overview.component.ts:29:93
       nonNullable: true
     }),
     chosenYear: new FormControl(moment().year(), { 
-      validators: [Validators.required, Validators.min(moment().year() - 5), Validators.max(moment().year() + 1)],
+      validators: [Validators.required, Validators.min(moment().year() - 5), Validators.max(moment().year() - 1)],
       nonNullable: true 
     })

[Survived] BooleanLiteral
app/components/course-overview/course-overview.component.ts:30:20
     }),
     chosenYear: new FormControl(moment().year(), { 
       validators: [Validators.required, Validators.min(moment().year() - 5), Validators.max(moment().year() + 1)],
-      nonNullable: true 
+      nonNullable: false 
     })
     });

[Killed] BlockStatement
app/components/course-overview/course-overview.component.ts:34:20
     })
     });
 
-  ngOnInit(): void {
-    this.getAllCourses();
-  }
+  ngOnInit(): void {}
 
   getAllCourses() : void {
killedBy: Component: CourseOverviewComponent Should return true
statusReason: Error: 1 component threw errors during cleanup

[Killed] BlockStatement
app/components/course-overview/course-overview.component.ts:38:26
     this.getAllCourses();
   }
 
-  getAllCourses() : void {
-    this.subscription = this.courseOverviewService
-      .getAllCourses()
-      .subscribe((courses: CourseOverview[]) => {
-        this.allcourses = courses;
-        this.isLoading = false;
-      })
-  }
+  getAllCourses() : void {}
 
   getCoursesWkYr() : void {
killedBy: Component: CourseOverviewComponent Should return true
statusReason: Error: 1 component threw errors during cleanup

[Survived] BlockStatement
app/components/course-overview/course-overview.component.ts:41:49
   getAllCourses() : void {
     this.subscription = this.courseOverviewService
       .getAllCourses()
-      .subscribe((courses: CourseOverview[]) => {
-        this.allcourses = courses;
-        this.isLoading = false;
-      })
+      .subscribe((courses: CourseOverview[]) => {})
   }
 

[Survived] BooleanLiteral
app/components/course-overview/course-overview.component.ts:43:26
       .getAllCourses()
       .subscribe((courses: CourseOverview[]) => {
         this.allcourses = courses;
-        this.isLoading = false;
+        this.isLoading = true;
       })
   }

[NoCoverage] BlockStatement
app/components/course-overview/course-overview.component.ts:47:27
       })
   }
 
-  getCoursesWkYr() : void {
-    let week = this.getCoursesByWeekYearForm.controls.chosenWeek.getRawValue();
-    let year = this.getCoursesByWeekYearForm.controls.chosenYear.getRawValue();
-    this.subscription = this.courseOverviewService
-      .getCoursesByWeekYear(week, year)
-      .subscribe((courses: CourseOverview[]) => {
-        this.allcourses = courses;
-        this.isLoading = false;
-      })
-  }
+  getCoursesWkYr() : void {}
 
   getCoursesCurrWk(week : number, year : number) : void {

[NoCoverage] BlockStatement
app/components/course-overview/course-overview.component.ts:52:49
     let year = this.getCoursesByWeekYearForm.controls.chosenYear.getRawValue();
     this.subscription = this.courseOverviewService
       .getCoursesByWeekYear(week, year)
-      .subscribe((courses: CourseOverview[]) => {
-        this.allcourses = courses;
-        this.isLoading = false;
-      })
+      .subscribe((courses: CourseOverview[]) => {})
   }
 

[NoCoverage] BlockStatement
app/components/course-overview/course-overview.component.ts:58:57
       })
   }
 
-  getCoursesCurrWk(week : number, year : number) : void {
-    this.subscription = this.courseOverviewService
-      .getCoursesByWeekYear(week, year)
-      .subscribe((courses: CourseOverview[]) => {
-        this.allcourses = courses;
-        this.isLoading = false;
-      })
-    this.getCoursesByWeekYearForm.controls.chosenYear.setValue(year);
-    this.getCoursesByWeekYearForm.controls.chosenWeek.setValue(week);
-  }
+  getCoursesCurrWk(week : number, year : number) : void {}
 
   getCoursesNextWk() {

[NoCoverage] BlockStatement
app/components/course-overview/course-overview.component.ts:69:22
     this.getCoursesByWeekYearForm.controls.chosenWeek.setValue(week);
   }
 
-  getCoursesNextWk() {
-    let week = this.getCoursesByWeekYearForm.controls.chosenWeek.getRawValue() + 1;
-    let year = this.getCoursesByWeekYearForm.controls.chosenYear.getRawValue();
-    this.subscription = this.courseOverviewService
-      .getCoursesByWeekYear(week, year)
-      .subscribe((courses: CourseOverview[]) => {
-        this.allcourses = courses;
-        this.isLoading = false;
-      })
-    this.getCoursesByWeekYearForm.controls.chosenYear.setValue(year);
-    this.getCoursesByWeekYearForm.controls.chosenWeek.setValue(week);
-  }
+  getCoursesNextWk() {}
 
   getCoursesPrevWk() {

[NoCoverage] ArithmeticOperator
app/components/course-overview/course-overview.component.ts:70:16
   }
 
   getCoursesNextWk() {
-    let week = this.getCoursesByWeekYearForm.controls.chosenWeek.getRawValue() + 1;
+    let week = this.getCoursesByWeekYearForm.controls.chosenWeek.getRawValue() - 1;
     let year = this.getCoursesByWeekYearForm.controls.chosenYear.getRawValue();
     this.subscription = this.courseOverviewService

[NoCoverage] BlockStatement
app/components/course-overview/course-overview.component.ts:82:22
     this.getCoursesByWeekYearForm.controls.chosenWeek.setValue(week);
   }
 
-  getCoursesPrevWk() {
-    let week = this.getCoursesByWeekYearForm.controls.chosenWeek.getRawValue() - 1;
-    let year = this.getCoursesByWeekYearForm.controls.chosenYear.getRawValue();
-    this.subscription = this.courseOverviewService
-      .getCoursesByWeekYear(week, year)
-      .subscribe((courses: CourseOverview[]) => {
-        this.allcourses = courses;
-        this.isLoading = false;
-      })
-    this.getCoursesByWeekYearForm.controls.chosenYear.setValue(year);
-    this.getCoursesByWeekYearForm.controls.chosenWeek.setValue(week);
-  }
+  getCoursesPrevWk() {}
 
   ngOnDestroy(): void {

[NoCoverage] ArithmeticOperator
app/components/course-overview/course-overview.component.ts:83:16
   }
 
   getCoursesPrevWk() {
-    let week = this.getCoursesByWeekYearForm.controls.chosenWeek.getRawValue() - 1;
+    let week = this.getCoursesByWeekYearForm.controls.chosenWeek.getRawValue() + 1;
     let year = this.getCoursesByWeekYearForm.controls.chosenYear.getRawValue();
     this.subscription = this.courseOverviewService

[Survived] BlockStatement
app/components/course-overview/course-overview.component.ts:95:23
     this.getCoursesByWeekYearForm.controls.chosenWeek.setValue(week);
   }
 
-  ngOnDestroy(): void {
-    this.subscription.unsubscribe();
-  }
+  ngOnDestroy(): void {}
 
 }
