[NoCoverage] StringLiteral
src/app/models/courseoverview.ts:5:27
     startDate?: string = ""
     duration: number = 0
     title: string = ""
-    courseCode?: string = ""
+    courseCode?: string = "Stryker was here!"
 }
