[NoCoverage] StringLiteral
app/services/check-file/check-file.service.ts:8:28
 })
 export class CheckFileService {
   async checkForErrors(text: string): Promise<string> {
-    let lines = text.split('\n');
+    let lines = text.split("");
     let counter : number = 0;
     let message : string = "";

[NoCoverage] StringLiteral
app/services/check-file/check-file.service.ts:10:28
   async checkForErrors(text: string): Promise<string> {
     let lines = text.split('\n');
     let counter : number = 0;
-    let message : string = "";
+    let message : string = "Stryker was here!";
 
     for(var i = 0; i < lines.length - 1; i++) {

[NoCoverage] EqualityOperator
app/services/check-file/check-file.service.ts:12:20
     let counter : number = 0;
     let message : string = "";
 
-    for(var i = 0; i < lines.length - 1; i++) {
+    for(var i = 0; i >= lines.length - 1; i++) {
       switch(counter) {
         case 0: {

[NoCoverage] UpdateOperator
app/services/check-file/check-file.service.ts:12:42
     let counter : number = 0;
     let message : string = "";
 
-    for(var i = 0; i < lines.length - 1; i++) {
+    for(var i = 0; i < lines.length - 1; i--) {
       switch(counter) {
         case 0: {

[NoCoverage] ConditionalExpression
app/services/check-file/check-file.service.ts:14:9
 
     for(var i = 0; i < lines.length - 1; i++) {
       switch(counter) {
-        case 0: {
-          if(!lines[i].startsWith('Titel:')) {
-            message = `Regel ${i + 1} start niet met 'Titel:'!`
-          }
-          break;
-        }
+        case 0:
         case 1: {
           if(!lines[i].startsWith('Cursuscode:')) {

[NoCoverage] BlockStatement
app/services/check-file/check-file.service.ts:14:17
 
     for(var i = 0; i < lines.length - 1; i++) {
       switch(counter) {
-        case 0: {
-          if(!lines[i].startsWith('Titel:')) {
-            message = `Regel ${i + 1} start niet met 'Titel:'!`
-          }
-          break;
-        }
+        case 0: {}
         case 1: {
           if(!lines[i].startsWith('Cursuscode:')) {

[NoCoverage] BooleanLiteral
app/services/check-file/check-file.service.ts:15:14
     for(var i = 0; i < lines.length - 1; i++) {
       switch(counter) {
         case 0: {
-          if(!lines[i].startsWith('Titel:')) {
+          if(lines[i].startsWith('Titel:')) {
             message = `Regel ${i + 1} start niet met 'Titel:'!`
           }

[NoCoverage] MethodExpression
app/services/check-file/check-file.service.ts:15:15
     for(var i = 0; i < lines.length - 1; i++) {
       switch(counter) {
         case 0: {
-          if(!lines[i].startsWith('Titel:')) {
+          if(!lines[i].endsWith('Titel:')) {
             message = `Regel ${i + 1} start niet met 'Titel:'!`
           }

[NoCoverage] ArithmeticOperator
app/services/check-file/check-file.service.ts:16:32
       switch(counter) {
         case 0: {
           if(!lines[i].startsWith('Titel:')) {
-            message = `Regel ${i + 1} start niet met 'Titel:'!`
+            message = `Regel ${i - 1} start niet met 'Titel:'!`
           }
           break;

[NoCoverage] StringLiteral
app/services/check-file/check-file.service.ts:16:23
       switch(counter) {
         case 0: {
           if(!lines[i].startsWith('Titel:')) {
-            message = `Regel ${i + 1} start niet met 'Titel:'!`
+            message = ``
           }
           break;

[NoCoverage] BlockStatement
app/services/check-file/check-file.service.ts:20:17
           }
           break;
         }
-        case 1: {
-          if(!lines[i].startsWith('Cursuscode:')) {
-            message = `Regel ${i + 1} start niet met 'Cursuscode:'!`
-          }
-          break;
-        }
+        case 1: {}
         case 2: {
           if(!lines[i].startsWith('Duur:') || !lines[i].endsWith('dagen')) {

[NoCoverage] ConditionalExpression
app/services/check-file/check-file.service.ts:20:9
           }
           break;
         }
-        case 1: {
-          if(!lines[i].startsWith('Cursuscode:')) {
-            message = `Regel ${i + 1} start niet met 'Cursuscode:'!`
-          }
-          break;
-        }
+        case 1:
         case 2: {
           if(!lines[i].startsWith('Duur:') || !lines[i].endsWith('dagen')) {

[NoCoverage] BooleanLiteral
app/services/check-file/check-file.service.ts:21:14
           break;
         }
         case 1: {
-          if(!lines[i].startsWith('Cursuscode:')) {
+          if(lines[i].startsWith('Cursuscode:')) {
             message = `Regel ${i + 1} start niet met 'Cursuscode:'!`
           }

[NoCoverage] ConditionalExpression
app/services/check-file/check-file.service.ts:21:14
           break;
         }
         case 1: {
-          if(!lines[i].startsWith('Cursuscode:')) {
+          if(true) {
             message = `Regel ${i + 1} start niet met 'Cursuscode:'!`
           }

[NoCoverage] ArithmeticOperator
app/services/check-file/check-file.service.ts:22:32
         }
         case 1: {
           if(!lines[i].startsWith('Cursuscode:')) {
-            message = `Regel ${i + 1} start niet met 'Cursuscode:'!`
+            message = `Regel ${i - 1} start niet met 'Cursuscode:'!`
           }
           break;

[NoCoverage] StringLiteral
app/services/check-file/check-file.service.ts:22:23
         }
         case 1: {
           if(!lines[i].startsWith('Cursuscode:')) {
-            message = `Regel ${i + 1} start niet met 'Cursuscode:'!`
+            message = ``
           }
           break;

[NoCoverage] ConditionalExpression
app/services/check-file/check-file.service.ts:26:9
           }
           break;
         }
-        case 2: {
-          if(!lines[i].startsWith('Duur:') || !lines[i].endsWith('dagen')) {
-            message = `Regel ${i + 1} start niet met 'Duur:' of eindigt niet met dagen!`
-          }
-          break;
-        }
+        case 2:
         case 3: {
           if(!lines[i].startsWith('Startdatum:') || !/[0-9]{1,2}\/[0-9]{2}\/[0-9]{4}$/.test(lines[i])) {

[NoCoverage] BlockStatement
app/services/check-file/check-file.service.ts:26:17
           }
           break;
         }
-        case 2: {
-          if(!lines[i].startsWith('Duur:') || !lines[i].endsWith('dagen')) {
-            message = `Regel ${i + 1} start niet met 'Duur:' of eindigt niet met dagen!`
-          }
-          break;
-        }
+        case 2: {}
         case 3: {
           if(!lines[i].startsWith('Startdatum:') || !/[0-9]{1,2}\/[0-9]{2}\/[0-9]{4}$/.test(lines[i])) {

[NoCoverage] BlockStatement
app/services/check-file/check-file.service.ts:27:76
           break;
         }
         case 2: {
-          if(!lines[i].startsWith('Duur:') || !lines[i].endsWith('dagen')) {
-            message = `Regel ${i + 1} start niet met 'Duur:' of eindigt niet met dagen!`
-          }
+          if(!lines[i].startsWith('Duur:') || !lines[i].endsWith('dagen')) {}
           break;
         }

[NoCoverage] ConditionalExpression
app/services/check-file/check-file.service.ts:27:14
           break;
         }
         case 2: {
-          if(!lines[i].startsWith('Duur:') || !lines[i].endsWith('dagen')) {
+          if(false) {
             message = `Regel ${i + 1} start niet met 'Duur:' of eindigt niet met dagen!`
           }

[NoCoverage] ArithmeticOperator
app/services/check-file/check-file.service.ts:28:32
         }
         case 2: {
           if(!lines[i].startsWith('Duur:') || !lines[i].endsWith('dagen')) {
-            message = `Regel ${i + 1} start niet met 'Duur:' of eindigt niet met dagen!`
+            message = `Regel ${i - 1} start niet met 'Duur:' of eindigt niet met dagen!`
           }
           break;

[NoCoverage] ConditionalExpression
app/services/check-file/check-file.service.ts:32:9
           }
           break;
         }
-        case 3: {
-          if(!lines[i].startsWith('Startdatum:') || !/[0-9]{1,2}\/[0-9]{2}\/[0-9]{4}$/.test(lines[i])) {
-            message = `Regel ${i + 1} start niet met 'Startdatum:' of heeft een incorrect format!`
-          }
-          break;
-        }
+        case 3:
         case 4: {
           if(lines[i].length != 0) {

[NoCoverage] BlockStatement
app/services/check-file/check-file.service.ts:32:17
           }
           break;
         }
-        case 3: {
-          if(!lines[i].startsWith('Startdatum:') || !/[0-9]{1,2}\/[0-9]{2}\/[0-9]{4}$/.test(lines[i])) {
-            message = `Regel ${i + 1} start niet met 'Startdatum:' of heeft een incorrect format!`
-          }
-          break;
-        }
+        case 3: {}
         case 4: {
           if(lines[i].length != 0) {

[NoCoverage] MethodExpression
app/services/check-file/check-file.service.ts:33:15
           break;
         }
         case 3: {
-          if(!lines[i].startsWith('Startdatum:') || !/[0-9]{1,2}\/[0-9]{2}\/[0-9]{4}$/.test(lines[i])) {
+          if(!lines[i].endsWith('Startdatum:') || !/[0-9]{1,2}\/[0-9]{2}\/[0-9]{4}$/.test(lines[i])) {
             message = `Regel ${i + 1} start niet met 'Startdatum:' of heeft een incorrect format!`
           }

[NoCoverage] ConditionalExpression
app/services/check-file/check-file.service.ts:33:14
           break;
         }
         case 3: {
-          if(!lines[i].startsWith('Startdatum:') || !/[0-9]{1,2}\/[0-9]{2}\/[0-9]{4}$/.test(lines[i])) {
+          if(true) {
             message = `Regel ${i + 1} start niet met 'Startdatum:' of heeft een incorrect format!`
           }

[NoCoverage] ArithmeticOperator
app/services/check-file/check-file.service.ts:34:32
         }
         case 3: {
           if(!lines[i].startsWith('Startdatum:') || !/[0-9]{1,2}\/[0-9]{2}\/[0-9]{4}$/.test(lines[i])) {
-            message = `Regel ${i + 1} start niet met 'Startdatum:' of heeft een incorrect format!`
+            message = `Regel ${i - 1} start niet met 'Startdatum:' of heeft een incorrect format!`
           }
           break;

[NoCoverage] BlockStatement
app/services/check-file/check-file.service.ts:38:17
           }
           break;
         }
-        case 4: {
-          if(lines[i].length != 0) {
-            message = `Regel ${i + 1} zou leeg moeten zijn!`
-          }
-          break;
-        }
+        case 4: {}
       }
       if(message != "") {

[NoCoverage] ConditionalExpression
app/services/check-file/check-file.service.ts:38:9
           }
           break;
         }
-        case 4: {
-          if(lines[i].length != 0) {
-            message = `Regel ${i + 1} zou leeg moeten zijn!`
-          }
-          break;
-        }
+        case 4:
       }
       if(message != "") {

[NoCoverage] BlockStatement
app/services/check-file/check-file.service.ts:39:36
           break;
         }
         case 4: {
-          if(lines[i].length != 0) {
-            message = `Regel ${i + 1} zou leeg moeten zijn!`
-          }
+          if(lines[i].length != 0) {}
           break;
         }

[NoCoverage] EqualityOperator
app/services/check-file/check-file.service.ts:39:14
           break;
         }
         case 4: {
-          if(lines[i].length != 0) {
+          if(lines[i].length == 0) {
             message = `Regel ${i + 1} zou leeg moeten zijn!`
           }

[NoCoverage] ArithmeticOperator
app/services/check-file/check-file.service.ts:40:32
         }
         case 4: {
           if(lines[i].length != 0) {
-            message = `Regel ${i + 1} zou leeg moeten zijn!`
+            message = `Regel ${i - 1} zou leeg moeten zijn!`
           }
           break;

[NoCoverage] StringLiteral
app/services/check-file/check-file.service.ts:40:23
         }
         case 4: {
           if(lines[i].length != 0) {
-            message = `Regel ${i + 1} zou leeg moeten zijn!`
+            message = ``
           }
           break;

[NoCoverage] ConditionalExpression
app/services/check-file/check-file.service.ts:45:10
           break;
         }
       }
-      if(message != "") {
+      if(true) {
           break;
       }

[NoCoverage] ConditionalExpression
app/services/check-file/check-file.service.ts:45:10
           break;
         }
       }
-      if(message != "") {
+      if(false) {
           break;
       }

[NoCoverage] BlockStatement
app/services/check-file/check-file.service.ts:48:31
       if(message != "") {
           break;
       }
-      else if (counter === 4) {
-        counter = 0;
-      }
+      else if (counter === 4) {}
       else {
         counter++;

[NoCoverage] EqualityOperator
app/services/check-file/check-file.service.ts:48:16
       if(message != "") {
           break;
       }
-      else if (counter === 4) {
+      else if (counter !== 4) {
         counter = 0;
       }

[NoCoverage] BlockStatement
app/services/check-file/check-file.service.ts:51:12
       else if (counter === 4) {
         counter = 0;
       }
-      else {
-        counter++;
-      }
+      else {}
     }
     return await message;

[NoCoverage] UpdateOperator
app/services/check-file/check-file.service.ts:52:9
         counter = 0;
       }
       else {
-        counter++;
+        counter--;
       }
     }
