[NoCoverage] ArrayDeclaration
app/services/course-overview/courseoverview.service.ts:13:51
 export class CourseOverviewService {
   constructor( private httpClient : HttpClient ) { }
 
-  subject = new BehaviorSubject<CourseOverview[]>([]);
+  subject = new BehaviorSubject<CourseOverview[]>(["Stryker was here"]);
   urlAllCourses : string = "https://localhost:7125/api/courses/all"
   urlWkYrCourses: string = "https://localhost:7125/api/courses/weekyear"

[NoCoverage] StringLiteral
app/services/course-overview/courseoverview.service.ts:14:28
   constructor( private httpClient : HttpClient ) { }
 
   subject = new BehaviorSubject<CourseOverview[]>([]);
-  urlAllCourses : string = "https://localhost:7125/api/courses/all"
+  urlAllCourses : string = ""
   urlWkYrCourses: string = "https://localhost:7125/api/courses/weekyear"
   allcourses: CourseOverview[] = [];

[NoCoverage] BlockStatement
app/services/course-overview/courseoverview.service.ts:18:50
   urlWkYrCourses: string = "https://localhost:7125/api/courses/weekyear"
   allcourses: CourseOverview[] = [];
 
-  getAllCourses() : Observable<CourseOverview[]> {
-    this.httpClient
-      .get<CourseOverview[]>(this.urlAllCourses)
-      .subscribe((courses: CourseOverview[]) => {
-        this.allcourses = courses;
-        this.subject.next(courses);
-      });
-
-    return this.subject.asObservable();
-  };
+  getAllCourses() : Observable<CourseOverview[]> {};
 
   getCoursesByWeekYear(week: number, year : number) : Observable<CourseOverview[]> {

[NoCoverage] BlockStatement
app/services/course-overview/courseoverview.service.ts:21:49
   getAllCourses() : Observable<CourseOverview[]> {
     this.httpClient
       .get<CourseOverview[]>(this.urlAllCourses)
-      .subscribe((courses: CourseOverview[]) => {
-        this.allcourses = courses;
-        this.subject.next(courses);
-      });
+      .subscribe((courses: CourseOverview[]) => {});
 
     return this.subject.asObservable();

[NoCoverage] BlockStatement
app/services/course-overview/courseoverview.service.ts:29:84
     return this.subject.asObservable();
   };
 
-  getCoursesByWeekYear(week: number, year : number) : Observable<CourseOverview[]> {
-    if (week === 0) {
-      week = moment().week();
-      year = moment().year();
-    }
-    let params = new HttpParams().set("week", week).set("year", year);
-    this.httpClient
-      .get<CourseOverview[]>(this.urlWkYrCourses, { params: params })
-      .subscribe((courses: CourseOverview[]) => {
-        this.allcourses = courses;
-        this.subject.next(courses);
-      });
-    return this.subject.asObservable();
-  };
+  getCoursesByWeekYear(week: number, year : number) : Observable<CourseOverview[]> {};
 
 }

[NoCoverage] EqualityOperator
app/services/course-overview/courseoverview.service.ts:30:9
   };
 
   getCoursesByWeekYear(week: number, year : number) : Observable<CourseOverview[]> {
-    if (week === 0) {
+    if (week !== 0) {
       week = moment().week();
       year = moment().year();

[NoCoverage] ConditionalExpression
app/services/course-overview/courseoverview.service.ts:30:9
   };
 
   getCoursesByWeekYear(week: number, year : number) : Observable<CourseOverview[]> {
-    if (week === 0) {
+    if (false) {
       week = moment().week();
       year = moment().year();

[NoCoverage] BlockStatement
app/services/course-overview/courseoverview.service.ts:37:49
     let params = new HttpParams().set("week", week).set("year", year);
     this.httpClient
       .get<CourseOverview[]>(this.urlWkYrCourses, { params: params })
-      .subscribe((courses: CourseOverview[]) => {
-        this.allcourses = courses;
-        this.subject.next(courses);
-      });
+      .subscribe((courses: CourseOverview[]) => {});
     return this.subject.asObservable();
   };
