[NoCoverage] ObjectLiteral
app/services/upload-file/uploadfile.service.ts:19:17
 
   objArray : CourseOverview[] = [];
 
-  httpOptions = {
-    headers: new HttpHeaders({'Content-Type': 'application/json'})
-  }
+  httpOptions = {}
 
   upload(text: string): CourseOverview[] {

[NoCoverage] StringLiteral
app/services/upload-file/uploadfile.service.ts:24:17
   }
 
   upload(text: string): CourseOverview[] {
-    console.log('Upload');
+    console.log("");
     var obj : CourseOverview = {} as CourseOverview;
     var lines = text.split('\n');

[NoCoverage] EqualityOperator
app/services/upload-file/uploadfile.service.ts:29:20
     var lines = text.split('\n');
     let counter = 0;
 
-    for(var i = 0; i < lines.length; i++) {
+    for(var i = 0; i <= lines.length; i++) {
       if(lines[i] !== "")
       {

[NoCoverage] UpdateOperator
app/services/upload-file/uploadfile.service.ts:29:38
     var lines = text.split('\n');
     let counter = 0;
 
-    for(var i = 0; i < lines.length; i++) {
+    for(var i = 0; i < lines.length; i--) {
       if(lines[i] !== "")
       {

[NoCoverage] EqualityOperator
app/services/upload-file/uploadfile.service.ts:30:10
     let counter = 0;
 
     for(var i = 0; i < lines.length; i++) {
-      if(lines[i] !== "")
+      if(lines[i] === "")
       {
         let index = lines[i].indexOf(":") + 2

[NoCoverage] ConditionalExpression
app/services/upload-file/uploadfile.service.ts:30:10
     let counter = 0;
 
     for(var i = 0; i < lines.length; i++) {
-      if(lines[i] !== "")
+      if(true)
       {
         let index = lines[i].indexOf(":") + 2

[NoCoverage] BlockStatement
app/services/upload-file/uploadfile.service.ts:31:7
 
     for(var i = 0; i < lines.length; i++) {
       if(lines[i] !== "")
-      {
-        let index = lines[i].indexOf(":") + 2
-        counter ++;
-        if(lines[i].startsWith('Titel:')) {
-          obj.title = lines[i].substring(index)
-        }
-        else if (lines[i].startsWith('Cursuscode:')) {
-          obj.courseCode = lines[i].substring(index)
-        }
-        else if (lines[i].startsWith('Duur:')) {
-          obj.duration = parseInt(lines[i].substring(index, index + 1));
-        }
-        else if (lines[i].startsWith('Startdatum:')) {
-          obj.startDate = lines[i].substring(index)
-        }
-      }
+      {}
       else {
         if (Object.keys(obj).length) {

[NoCoverage] ArithmeticOperator
app/services/upload-file/uploadfile.service.ts:32:21
     for(var i = 0; i < lines.length; i++) {
       if(lines[i] !== "")
       {
-        let index = lines[i].indexOf(":") + 2
+        let index = lines[i].indexOf(":") - 2
         counter ++;
         if(lines[i].startsWith('Titel:')) {

[NoCoverage] StringLiteral
app/services/upload-file/uploadfile.service.ts:32:38
     for(var i = 0; i < lines.length; i++) {
       if(lines[i] !== "")
       {
-        let index = lines[i].indexOf(":") + 2
+        let index = lines[i].indexOf("") + 2
         counter ++;
         if(lines[i].startsWith('Titel:')) {

[NoCoverage] UpdateOperator
app/services/upload-file/uploadfile.service.ts:33:9
       if(lines[i] !== "")
       {
         let index = lines[i].indexOf(":") + 2
-        counter ++;
+        counter--;
         if(lines[i].startsWith('Titel:')) {
           obj.title = lines[i].substring(index)

[NoCoverage] MethodExpression
app/services/upload-file/uploadfile.service.ts:34:12
       {
         let index = lines[i].indexOf(":") + 2
         counter ++;
-        if(lines[i].startsWith('Titel:')) {
+        if(lines[i].endsWith('Titel:')) {
           obj.title = lines[i].substring(index)
         }

[NoCoverage] BlockStatement
app/services/upload-file/uploadfile.service.ts:34:43
       {
         let index = lines[i].indexOf(":") + 2
         counter ++;
-        if(lines[i].startsWith('Titel:')) {
-          obj.title = lines[i].substring(index)
-        }
+        if(lines[i].startsWith('Titel:')) {}
         else if (lines[i].startsWith('Cursuscode:')) {
           obj.courseCode = lines[i].substring(index)

[NoCoverage] MethodExpression
app/services/upload-file/uploadfile.service.ts:35:23
         let index = lines[i].indexOf(":") + 2
         counter ++;
         if(lines[i].startsWith('Titel:')) {
-          obj.title = lines[i].substring(index)
+          obj.title = lines[i]
         }
         else if (lines[i].startsWith('Cursuscode:')) {

[NoCoverage] BlockStatement
app/services/upload-file/uploadfile.service.ts:37:54
         if(lines[i].startsWith('Titel:')) {
           obj.title = lines[i].substring(index)
         }
-        else if (lines[i].startsWith('Cursuscode:')) {
-          obj.courseCode = lines[i].substring(index)
-        }
+        else if (lines[i].startsWith('Cursuscode:')) {}
         else if (lines[i].startsWith('Duur:')) {
           obj.duration = parseInt(lines[i].substring(index, index + 1));

[NoCoverage] ConditionalExpression
app/services/upload-file/uploadfile.service.ts:37:18
         if(lines[i].startsWith('Titel:')) {
           obj.title = lines[i].substring(index)
         }
-        else if (lines[i].startsWith('Cursuscode:')) {
+        else if (true) {
           obj.courseCode = lines[i].substring(index)
         }

[NoCoverage] MethodExpression
app/services/upload-file/uploadfile.service.ts:38:28
           obj.title = lines[i].substring(index)
         }
         else if (lines[i].startsWith('Cursuscode:')) {
-          obj.courseCode = lines[i].substring(index)
+          obj.courseCode = lines[i]
         }
         else if (lines[i].startsWith('Duur:')) {

[NoCoverage] ConditionalExpression
app/services/upload-file/uploadfile.service.ts:40:18
         else if (lines[i].startsWith('Cursuscode:')) {
           obj.courseCode = lines[i].substring(index)
         }
-        else if (lines[i].startsWith('Duur:')) {
+        else if (true) {
           obj.duration = parseInt(lines[i].substring(index, index + 1));
         }

[NoCoverage] MethodExpression
app/services/upload-file/uploadfile.service.ts:40:18
         else if (lines[i].startsWith('Cursuscode:')) {
           obj.courseCode = lines[i].substring(index)
         }
-        else if (lines[i].startsWith('Duur:')) {
+        else if (lines[i].endsWith('Duur:')) {
           obj.duration = parseInt(lines[i].substring(index, index + 1));
         }

[NoCoverage] MethodExpression
app/services/upload-file/uploadfile.service.ts:41:35
           obj.courseCode = lines[i].substring(index)
         }
         else if (lines[i].startsWith('Duur:')) {
-          obj.duration = parseInt(lines[i].substring(index, index + 1));
+          obj.duration = parseInt(lines[i]);
         }
         else if (lines[i].startsWith('Startdatum:')) {

[NoCoverage] ArithmeticOperator
app/services/upload-file/uploadfile.service.ts:41:61
           obj.courseCode = lines[i].substring(index)
         }
         else if (lines[i].startsWith('Duur:')) {
-          obj.duration = parseInt(lines[i].substring(index, index + 1));
+          obj.duration = parseInt(lines[i].substring(index, index - 1));
         }
         else if (lines[i].startsWith('Startdatum:')) {

[NoCoverage] MethodExpression
app/services/upload-file/uploadfile.service.ts:43:18
         else if (lines[i].startsWith('Duur:')) {
           obj.duration = parseInt(lines[i].substring(index, index + 1));
         }
-        else if (lines[i].startsWith('Startdatum:')) {
+        else if (lines[i].endsWith('Startdatum:')) {
           obj.startDate = lines[i].substring(index)
         }

[NoCoverage] BlockStatement
app/services/upload-file/uploadfile.service.ts:43:54
         else if (lines[i].startsWith('Duur:')) {
           obj.duration = parseInt(lines[i].substring(index, index + 1));
         }
-        else if (lines[i].startsWith('Startdatum:')) {
-          obj.startDate = lines[i].substring(index)
-        }
+        else if (lines[i].startsWith('Startdatum:')) {}
       }
       else {

[NoCoverage] MethodExpression
app/services/upload-file/uploadfile.service.ts:44:27
           obj.duration = parseInt(lines[i].substring(index, index + 1));
         }
         else if (lines[i].startsWith('Startdatum:')) {
-          obj.startDate = lines[i].substring(index)
+          obj.startDate = lines[i]
         }
       }

[NoCoverage] BlockStatement
app/services/upload-file/uploadfile.service.ts:47:12
           obj.startDate = lines[i].substring(index)
         }
       }
-      else {
-        if (Object.keys(obj).length) {
-          this.objArray.push(obj as CourseOverview);
-          counter = 0;
-          obj = {} as CourseOverview;
-        }
-      }
+      else {}
     }
     return this.objArray;

[NoCoverage] BlockStatement
app/services/upload-file/uploadfile.service.ts:48:38
         }
       }
       else {
-        if (Object.keys(obj).length) {
-          this.objArray.push(obj as CourseOverview);
-          counter = 0;
-          obj = {} as CourseOverview;
-        }
+        if (Object.keys(obj).length) {}
       }
     }

[NoCoverage] ConditionalExpression
app/services/upload-file/uploadfile.service.ts:48:13
         }
       }
       else {
-        if (Object.keys(obj).length) {
+        if (false) {
           this.objArray.push(obj as CourseOverview);
           counter = 0;

[NoCoverage] BlockStatement
app/services/upload-file/uploadfile.service.ts:58:71
     return this.objArray;
  }
 
-  async PostCourses(objArray : object[]) : Promise<CoursesAddedStats> {
-    console.log('Post');
-    this.stats = await firstValueFrom(this.http.post<CoursesAddedStats>('https://localhost:7125/api/courses', objArray, this.httpOptions))
-    console.log('Post complete')
-    this.objArray = [];
-    return this.stats;
-  }
+  async PostCourses(objArray : object[]) : Promise<CoursesAddedStats> {}
 
   

[NoCoverage] StringLiteral
app/services/upload-file/uploadfile.service.ts:59:17
  }
 
   async PostCourses(objArray : object[]) : Promise<CoursesAddedStats> {
-    console.log('Post');
+    console.log("");
     this.stats = await firstValueFrom(this.http.post<CoursesAddedStats>('https://localhost:7125/api/courses', objArray, this.httpOptions))
     console.log('Post complete')
