[NoCoverage] BlockStatement
src/main.ts:7:29
 import { AppModule } from './app/app.module';
 import { environment } from './environments/environment';
 
-if (environment.production) {
-  enableProdMode();
-}
+if (environment.production) {}
 
 platformBrowserDynamic().bootstrapModule(AppModule)

[NoCoverage] ConditionalExpression
src/main.ts:7:5
 import { AppModule } from './app/app.module';
 import { environment } from './environments/environment';
 
-if (environment.production) {
+if (true) {
   enableProdMode();
 }

[NoCoverage] ArrowFunction
src/main.ts:12:10
 }
 
 platformBrowserDynamic().bootstrapModule(AppModule)
-  .catch(err => console.error(err));
+  .catch(() => undefined);
 
